Repository: ergunozbudakli/ProfilSayfam
Catalog: ProfilSayfam/Resources/Views/Home/Index.*.resx
Languages: tr_tr

source: Welcome to My Page
tr_tr: Sayfama Hoş Geldiniz

source: Hello, I am
tr_tr: Merhaba, Ben

source: Content
tr_tr: İçerik

source: About Me
tr_tr: Hakkımda

source: Current Position
tr_tr: Şu Anki Pozisyonum

# CurrentPositionText
source: With 3+ years of experience as a Software Engineer, I have worked in Full Stack Developer positions. I have strong technical knowledge in .NET Core, Angular, React, SQL Server, and Web APIs. I have optimized business processes and increased efficiency by developing in-house custom software. I am seeking opportunities to add value in a new position using my knowledge and experience.
tr_tr: Yazılım mühendisi olarak 3+ yıllık deneyimim ile Full Stack Developer pozisyonlarında görev aldım. .NET Core, Angular, React, SQL Server ve Web API konularında güçlü teknik bilgiye sahibim. Şirket içi özel yazılımlar geliştirerek iş süreçlerini optimize ettim ve verimlilik artışı sağladım. Yeni bir pozisyonda bilgi ve deneyimlerimi kullanarak değer katmak için fırsatlar arıyorum.

source: Last Experience
tr_tr: Son İş Tecrübem

# AboutMeText1
source: I worked as a Full Stack Developer at Efece Galvaniz.
tr_tr: Efece Galvaniz firmasında Full Stack Developer olarak çalıştım.

# AboutMeText2
source: Here, I developed a custom software called Nova that integrated with the Netsis program.
tr_tr: Burada, Netsis programı ile entegre çalışan Nova adında şirkete özel bir yazılım geliştirdim.

# AboutMeText3
source: Through this program, employees were able to track inventory, customer information, and monitor live production using a barcode system.
tr_tr: Bu program sayesinde çalışanlar, stok takibi, müşteri takibi ve barkod sistemi ile canlı üretim takibi yapabildiler.

# AboutMeText4
source: We used Microsoft SQL Server as the database backend for our application.
tr_tr: Uygulamamızın arka planında veritabanı olarak Microsoft SQL Server kullandık.

# AboutMeText5
source: I developed a Web Service (API) to facilitate data communication between SQL Server and our application.
tr_tr: Geliştirdiğim Web Service (API) üzerinden SQL Server ile uygulamamız arasındaki veri iletişimini sağladık.

# AboutMeText6
source: Each user had their own account and authorization roles. They could access modules specific to their positions based on these permissions.
tr_tr: Her kullanıcının kendine özel hesabı ve yetki rolleri bulunmaktaydı. Bu yetkiler doğrultusunda kendi pozisyonlarına ait modüllere erişim sağlayabildiler.

# AboutMeText7
source: My goal was to improve company performance and increase profits by implementing modern innovations throughout the organization through the application.
tr_tr: Hedefim, çağın gerektirdiği tüm yenilikleri uygulama üzerinden şirket geneline yayarak, her geçen gün daha iyi performans ve artan şirket kârı elde etmekti.

source: Skills
tr_tr: Yeteneklerim

source: What I Do
tr_tr: Ne Yapıyorum

source: Education
tr_tr: Eğitim

source: Software Engineering
tr_tr: Yazılım Mühendisliği

source: High School
tr_tr: Lise

source: Experience
tr_tr: Deneyim

source: Software Engineer
tr_tr: Yazılım Mühendisi

# SoftwareSupport
source: Software Support Specialist
tr_tr: Yazılım Destek Uzmanı

source: Career
tr_tr: Kariyer

source: Contact
tr_tr: İletişim

source: Name
tr_tr: İsim

source: Subject
tr_tr: Konu

source: Message
tr_tr: Mesaj

source: Send
tr_tr: Gönder

source: Home
tr_tr: Anasayfa

source: Send Message
tr_tr: Mesaj Gönder

# EfeceGalvanizDescription
source: As a Full Stack Developer, I developed a custom software integrated with Netsis.
tr_tr: Full Stack Developer olarak Netsis ile entegre çalışan özel bir yazılım geliştirdim.

# CSistemDescription
source: I facilitated communication and coordination between municipal staff and our software team regarding municipal software solutions.
tr_tr: Belediye yazılımı konusunda belediye personeli ile yazılım ekibimiz arasındaki iletişimi ve koordinasyonu sağladım.

# Etiya
source: Etiya Information Technologies
tr_tr: Etiya Bilgi Teknolojileri

# EtiyaDescription
source: I provided infrastructure support through SQL queries in our Türk Telekom project.
tr_tr: Türk Telekom projemizde SQL sorguları üzerinden altyapısal destek sağladım.

source: Format Converter
tr_tr: Format Dönüştürücü

# FormatConverterDescription
source: A user-friendly tool to convert your PDF files to Word format.
tr_tr: PDF dosyalarınızı Word formatına dönüştürebileceğiniz kullanıcı dostu bir araç.

# FormatConverterFeedback
source: This project is continuously evolving, and I am working to ensure the most accurate conversion of PDF files to Word format. Your feedback about any issues encountered during the conversion process through the contact section would be invaluable for the project's development.
tr_tr: Sürekli gelişen bu projede, PDF dosyalarının Word formatına en doğru şekilde dönüştürülmesi için çalışmalarım devam etmektedir. Dönüştürme işlemi sırasında karşılaştığınız sorunları iletişim bölümünden paylaşmanız, projenin gelişimine değerli katkılar sağlayacaktır.

# SkillsText1
source: • Developing modern web applications using .NET Core MVC, Web API, and Entity Framework Core
tr_tr: • .NET Core MVC, Web API ve Entity Framework Core kullanarak modern web uygulamaları geliştirme

# SkillsText2
source: • Advanced experience in Microsoft SQL Server, T-SQL, Stored Procedures, and Functions
tr_tr: • Microsoft SQL Server, T-SQL, Stored Procedure ve Function geliştirme konusunda ileri seviye deneyim

# SkillsText3
source: • User interface development with modern frontend technologies like Angular and React
tr_tr: • Angular ve React gibi modern frontend teknolojileri ile kullanıcı arayüzü geliştirme

# SkillsText4
source: • Creating dynamic web applications with jQuery and JavaScript
tr_tr: • jQuery ve JavaScript ile dinamik web uygulamaları oluşturma

# SkillsText5
source: • Writing sustainable code by applying SOLID principles and design patterns
tr_tr: • SOLID prensipleri ve tasarım desenlerini uygulayarak sürdürülebilir kod yazma

# SkillsText6
source: • Project management and teamwork with Agile/Scrum methodologies
tr_tr: • Agile/Scrum metodolojileri ile proje yönetimi ve takım çalışması

# SkillsText7
source: • Strong communication skills and problem-solving ability
tr_tr: • Güçlü iletişim becerileri ve problem çözme yeteneği

# PersonnelTrackingSystem
source: I took a leading role in the development and implementation of the personnel tracking system within the company. We modernized the entry-exit tracking with a QR code system specially designed for each employee. By automating personnel time tracking through tablet-based readers, I enabled the Human Resources department to manage timesheet data more efficiently and accurately. Through this system, I minimized errors from manual data entry while enabling secure and transparent digital tracking of personnel attendance.
tr_tr: Şirket bünyesinde personel takip sisteminin geliştirilmesi ve implementasyonunda öncü rol aldım. Her çalışana özel olarak tasarlanan QR kod sistemi ile giriş-çıkış takibini modernize ettik. Tablet tabanlı okuyucular aracılığıyla personelin mesai takibini otomatize ederek, İnsan Kaynakları departmanının puantaj verilerini daha verimli ve hatasız bir şekilde yönetmesini sağladım. Bu sistem sayesinde manuel veri girişinden kaynaklanan hataları minimize ederken, personel devam takibinin dijital ortamda güvenli ve şeffaf bir şekilde yapılmasını mümkün kıldım.

# WebHelpDescription
source: I served as a software support specialist in the LEIA project. In this project, we provided technical support to iPhone customers and coordinated with the software team in Ireland to resolve issues when needed. By focusing on customer satisfaction, I ensured that technical problems were resolved quickly and effectively.
tr_tr: LEIA projesinde yazılım destek uzmanı olarak görev aldım. Bu projede iPhone müşterilerine teknik destek sağlayıp, gerektiğinde İrlanda'daki yazılım ekibi ile koordinasyon kurarak sorunlara çözüm getiriyorduk. Müşteri memnuniyeti odaklı çalışarak, teknik sorunların hızlı ve etkili bir şekilde çözülmesini sağladım.

source: Reference Projects
tr_tr: Referans Projelerim

# ReferenceProjectsDescription
source: My actively developed projects that you can experience in a live environment. These works include professional applications developed using modern technologies and best software practices.
tr_tr: Aktif olarak geliştirdiğim ve canlı ortamda deneyimleyebileceğiniz projelerim. Bu çalışmalar, modern teknolojiler ve en iyi yazılım pratiklerini kullanarak geliştirdiğim profesyonel uygulamaları içermektedir.

source: Free to Use
tr_tr: Ücretsiz Kullanım

source: High Accuracy
tr_tr: Yüksek Doğruluk

source: Instant Conversion
tr_tr: Anında Dönüşüm

# TryConverter
source: Try our free PDF to Word converter
tr_tr: Ücretsiz PDF'den Word'e dönüştürücüyü deneyin
